In [1]:
import pandas as pd

In [10]:
#reading the data and store it into an obj
stud=pd.read_csv("C://Users/User/Data Projects/Student.csv",)

In [11]:
print(type(stud))

<class 'pandas.core.frame.DataFrame'>

In [12]:
#making a copy of the stored data
df=stud.copy()

In [13]:
df

   Enrollment_NO     Name  Science_Marks
0              4  Linnett             79
1              5   Jayden             45
2              6      Sam             63
3              7    Zooey             82
4              8     Robb             97
5              9      Jon             38
6             10    Sansa             54
7             11     Arya             78

In [14]:
#only 1st 5 data to show
df.head()

   Enrollment_NO     Name  Science_Marks
0              4  Linnett             79
1              5   Jayden             45
2              6      Sam             63
3              7    Zooey             82
4              8     Robb             97

In [15]:
#to show what are the columns we have
df.columns

Index(['Enrollment_NO', 'Name', 'Science_Marks'], dtype='object')

In [16]:
#if we need to change the columns name 
df.columns=['ID','Student Name','Marks']

In [17]:
df.columns

Index(['ID', 'Student Name', 'Marks'], dtype='object')

In [18]:
#know the shape (how many rows and columns) including headers
df.shape

(8, 3)

In [19]:
#show the data types
df.dtypes

ID               int64
Student Name    object
Marks            int64
dtype: object

In [20]:
# for a quick statistics we can use describe method
df.describe()
#it will only give output of the int values

             ID     Marks
count   8.00000   8.00000
mean    7.50000  67.00000
std     2.44949  20.35401
min     4.00000  38.00000
25%     5.75000  51.75000
50%     7.50000  70.50000
75%     9.25000  79.75000
max    11.00000  97.00000

In [21]:
#to consider all the objects including int and str
df.describe(include='all')

              ID Student Name     Marks
count    8.00000            8   8.00000
unique       NaN            8       NaN
top          NaN       Jayden       NaN
freq         NaN            1       NaN
mean     7.50000          NaN  67.00000
std      2.44949          NaN  20.35401
min      4.00000          NaN  38.00000
25%      5.75000          NaN  51.75000
50%      7.50000          NaN  70.50000
75%      9.25000          NaN  79.75000
max     11.00000          NaN  97.00000

In [22]:
#for column wise analytics...if i want a particular column
df['ID']

0     4
1     5
2     6
3     7
4     8
5     9
6    10
7    11
Name: ID, dtype: int64

In [23]:
df.ID.describe()

count     8.00000
mean      7.50000
std       2.44949
min       4.00000
25%       5.75000
50%       7.50000
75%       9.25000
max      11.00000
Name: ID, dtype: float64

In [28]:
#as it is a multi string name, so making this count like this
ss=df["Student Name"]

In [29]:
ss.describe()

count          8
unique         8
top       Jayden
freq           1
Name: Student Name, dtype: object

In [30]:
#to find null value
df.isnull()
#is there any null there

      ID  Student Name  Marks
0  False         False  False
1  False         False  False
2  False         False  False
3  False         False  False
4  False         False  False
5  False         False  False
6  False         False  False
7  False         False  False

In [31]:
#to sum up the null value in each column
df.isnull().sum()

ID              0
Student Name    0
Marks           0
dtype: int64

In [34]:
#iloc -- slicing, how many data i want to take
df.iloc[:3,:2]
#3 means how many row, 2 how many columns

   ID Student Name
0   4      Linnett
1   5       Jayden
2   6          Sam

In [38]:
df.iloc[2:6,1:3]
#2 to 6(left out 6) no rows and 1 to 3 no columns

  Student Name  Marks
2          Sam     63
3        Zooey     82
4         Robb     97
5          Jon     38

In [40]:
few=df.iloc[2:6,1:3]

In [41]:
few.describe()

           Marks
count   4.000000
mean   70.000000
std    25.468935
min    38.000000
25%    56.750000
50%    72.500000
75%    85.750000
max    97.000000

In [42]:
few

  Student Name  Marks
2          Sam     63
3        Zooey     82
4         Robb     97
5          Jon     38

In [44]:
#to delete 
few.drop(2, inplace=True)
#inplace = true to make this as a replacable element
#it will delete the 2 numbered column, executing this few will start from 3 no column

In [45]:
few

  Student Name  Marks
3        Zooey     82
4         Robb     97
5          Jon     38

In [48]:
few.index[2]

5

In [49]:
few.iloc[2]

Student Name    Jon
Marks            38
Name: 5, dtype: object

In [53]:
few.loc[3]
#iloc will return value assuming the param as index value, but loc will return assuming the param as specific value number

Student Name    Zooey
Marks              82
Name: 3, dtype: object

In [ ]:
# if i write loc[2] for few ,will return error, as we delete 2

In [54]:
df.tail()
#return last 5 rows of data

   ID Student Name  Marks
3   7        Zooey     82
4   8         Robb     97
5   9          Jon     38
6  10        Sansa     54
7  11         Arya     78

In [55]:
#by loc we can insert data
few.loc[2]=['Piyas',90]

In [56]:
#now loc[2] for few will return value
few.loc[2]

Student Name    Piyas
Marks              90
Name: 2, dtype: object

In [57]:
few
#by default last inserted value stored at last

  Student Name  Marks
3        Zooey     82
4         Robb     97
5          Jon     38
2        Piyas     90

In [58]:
#to delete columns
few.drop('Marks',axis=1,inplace=True)

In [59]:
few

  Student Name
3        Zooey
4         Robb
5          Jon
2        Piyas

In [60]:
few=df.iloc[2:6,1:3]

In [61]:
few

  Student Name  Marks
2          Sam     63
3        Zooey     82
4         Robb     97
5          Jon     38

In [63]:
few.loc[6]=['Piyas',90]

In [64]:
few

  Student Name  Marks
2          Sam     63
3        Zooey     82
4         Robb     97
5          Jon     38
6        Piyas     90

In [68]:
#add new column
few['diff']=100-few['Marks']

In [69]:
few

  Student Name  Marks  diff
2          Sam     63    37
3        Zooey     82    18
4         Robb     97     3
5          Jon     38    62
6        Piyas     90    10